communication/01_client_sts_outbound.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-16190602">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue
		</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-30540747">
			urn:uuid:e53e140a-3ace-41b7-9181-dbb39ac13a6f
		</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-25095750">http://localhost:8080/SecurityTokenService/UT</To>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-5062832">
			<Address>
				http://www.w3.org/2005/08/addressing/anonymous
			</Address>
		</ReplyTo>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsu:Timestamp wsu:Id="TS-1">
				<wsu:Created>2013-09-04T07:24:27.361Z
				</wsu:Created>
				<wsu:Expires>2013-09-04T07:29:27.361Z</wsu:Expires>
			</wsu:Timestamp>
			<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="EK-FDAAB3AADBF82F327813782794675481">
				<xenc:EncryptionMethod
					Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference
						xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
						<wsse:KeyIdentifier
							EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">l38MHAoulTTTEKjgU4D1ZTUkyj8=
						</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>
						UFELzyvp7dQc4dJlQFgzt8wW0oCoIISMm40X2g81oYhpplmwP1rEorVfi5dWwKrkPSjYaxeOct6Esmsa60xX
						YkZMQbsoeilKKMl2VZQEvxjDE0PZf0iwx9Bd6vomtEDV/KpaQo3cqJaBxnX2052tEKMnOKvfM9w9Ulyssa0074E=
					</xenc:CipherValue>
				</xenc:CipherData>
			</xenc:EncryptedKey>
			<wsc:DerivedKeyToken
				xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				wsu:Id="DK-3">
				<wsse:SecurityTokenReference
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
					wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"
					wsu:Id="STR-FDAAB3AADBF82F327813782794676422">
					<wsse:Reference URI="#EK-FDAAB3AADBF82F327813782794675481"
						ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" />
				</wsse:SecurityTokenReference>
				<wsc:Offset>0</wsc:Offset>
				<wsc:Length>24</wsc:Length>
				<wsc:Nonce>xO9pBniz/41UuHl2igMLDA==</wsc:Nonce>
			</wsc:DerivedKeyToken>
			<wsc:DerivedKeyToken
				xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
				wsu:Id="DK-5">
				<wsse:SecurityTokenReference
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
					wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"
					wsu:Id="STR-FDAAB3AADBF82F327813782794676895">
					<wsse:Reference URI="#EK-FDAAB3AADBF82F327813782794675481"
						ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" />
				</wsse:SecurityTokenReference>
				<wsc:Offset>0</wsc:Offset>
				<wsc:Length>32</wsc:Length>
				<wsc:Nonce>3QuNdFdgE7WlulThPWWWTQ==</wsc:Nonce>
			</wsc:DerivedKeyToken>
			<xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
				<xenc:DataReference URI="#ED-6" />
				<xenc:DataReference URI="#ED-7" />
				<xenc:DataReference URI="#ED-8" />
			</xenc:ReferenceList>
			<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="ED-8" Type="http://www.w3.org/2001/04/xmlenc#Element">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference
						xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
						<wsse:Reference URI="#DK-5"
							ValueType="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512/dk" />
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>VxGyOlk8qdslh8q+PhxVQyiFIpbXddd4jy8GULBZTARKzTOXn99wevILoKE
						5eSF4s5MnWWZjfJ/KOLB5JFq1mbE6PCysk7IyQc8ExYRqTdCwZ87b9keAdVSHsR1cS1Yc9Ib4I8WCmGWWR5lMYSM7p/lYgWAxlQO
						EvXKBrUpU+TWjHFWKIZa5YWcsbaJ3JMquSpIZwVdeCulcYzWPkIq5d06Pe/K5kfZHyRlr78GhHFuV+tyqXezzXxs4t4KDPcgzDlp
						h2bJVeB1cbMZAlzL9V6axB5x4zPH4tH88QrKfcXV99vOxQi+HS0A+hm1On2u5hnfR60Zy5CutX9DUsKp4qTqcdf4o1tR4QfaWvTA
						J1mA=
					</xenc:CipherValue>
				</xenc:CipherData>
			</xenc:EncryptedData>
			<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="ED-7" Type="http://www.w3.org/2001/04/xmlenc#Element">
				<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference
						xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
						<wsse:Reference URI="#DK-5"
							ValueType="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512/dk" />
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>
						AmW+7k1JBjg/W2UKYvDAMVt0FdreNmgude2a68F28/WRYMhGuyNK0kAnJmBxHqgr6u
						mB/8VZ1MXYPqoFdpAMMefME71n2VKMQHDEn4611T4Gz4bRaUQfaA1JNial3Z1lrOF4UF5spaybRSabT0WBGmc1bk11vSMI3VT4qs
						GkiqL/b6lyNRHUDHCWcdDWXjRDnA3GmFEX5Vd4Hh2gaZ1zHoO9RlOCQW6RyydpFe3jSCXDElYMHOpxdVEVU+M7brxS+Wk6SWgcoL
						MmdhGrgQ0F4dRoprgQjy08S0IWrBKeJnDOjdCK+yAqZGy44JRkUoPU0z2Ce/ajWl+UchyDYvmHOX7rUwCqkKx+nNCiDhrD3wz+1L
						e0LUf4P+GjD5kdRK/QpC3tDrymaimiwXl41m5SQLh6jKT3cRbm+b67ANUZflf3tqUBLYu3H5q6WM/qB1fgkeNfzVhNCPBd8yr0XR
						nkrPpaLbk/L2GrEA0FPVvijzzTZXdvu7d6glBRhug3Ubal7/WUHVclfEBwgFXQwPbA2yXaHusbQj8y8iowFLhOpdmm0iYiMWAJ0s
						6tVSbyNv0KAKzf11Y2nLTGTbhs6kLciySr9hmb0hik8uHLozTYyBcccuaXfKQ/RPkZUBjniOJEnm7T5RuVQn7vszHg6MxIKTE8pu
						4seq2bRcLOPGazKTyagGx8g+0ohuW1XDriUdi1p8/S4yX1Bowdj/it/gRBjVyD9NlbZXExUAY0NAjbQjdUZVCU5dZTAa47N3yn3b
						x+zpyaGypzOhD234Mb9zzTt4yRx9mDmzhFxje+tb9VSpq0wDWwX0NAXS8FknWHUewOL0SzV7oNuAGBeZnPieBLn5uXOicoiLrysr
						A4k7iT3Qz9DZ2v0jWU5u/4kMM8IuDPBb91a+xc24CX4xsosYQIDkLp9xFsj40fZNlrIwU5TskDhruGZjbC6yTI8wNh7kBmNlIxOo
						h41mATbB5ssq92DwVVp7cpwIecrfeTWQ7HcsoYNbmiXGiMuBXNOmHy30FWkrwgaIgAgQR3hjt7Ojz2BP0nDXuBpHBYmL3Co/yCEQ
						9qwAVLlu64yvWN4kVXyMnpN+Du2qRfEoGZJgaAC3KP7UXXJBkzqfYwci2m218zUarWZGG0O+9zSDkTGb3mcqcH70bFiIfZsNPDlm
						X7SVzOedsjFFkfA4b9ofMC2gy78JlXA3sbHcWhb/9NN15BiW/QnysC6zOXddpdhV3kpTLimKiS3IPXUUwxR5kjZudXF6WR9+lc3I
						HNAN5l1qenW3FAy5qIRbBGVocExd9LufUbZO25Ou14yBeCtlI6/DwRaFWxQetRfCHi2UPNBTkGublnLIwnToQzy3PyQiep62MgC/
						2rSvKcSYkO/hZKgZjnO6ad+GofsNbaCRaO3TfAh4gz6pFznvLs6COT9NzyuFVbDkF6FeX01MpdgNiaPVTh8we8GdNLq+/ZEQEhgV
						rXqY9MrKFNQJo14SuSdykhqPIHvSn2avtXbgeZTThpX0WYzUDE7kSMrMtf8nj8Y/RvcYZuDzflweZCBnzkOwO4FCwY0rX7wJUZZZ
						HSVbpGWKxsyfqipLQ4Bn5USLo1nhObApHcaKT+aqUW6zRxgki4judwiBtBVtJSfI5dX7vXj7WkR3Ug3j1rJcJ68pbl1V69iKFBbz
						JA/OflCt0gmrHRcJ/Xx7aEZ/0qxghW6zkkLtD/o5Eqjz9Q9bMOAH1HgnHW3qK0ys8GLhjNz7oZQj9cHIqMFT6qlf8mU1dcMouV+N
						G9xyOkbnnX+WS3mb1ci0TcoW176MGJgAA7afsy16h/bn0f7Y+vQ4Lrnldr8QcNJ1qj8ZN3UuFKsd46JOdo5pEHuHOsaKyS9fBRZr
						9qyOqmcAXq/g70ullGzuSZEUEkvwTEMQZ0WGY88FLKZ/016afNhzZngD/T3duN2KiiKfFgw0m1CNxTHej/Gq3Z5y8y63vmoTqzaY
						CwyB/+r3Z2KTnARx+l+feKhiAl/RncA9GwU0YGjHUL9ltiMux+zTbppXYSSE5lDisjC7m8+c7gXgZCIBFd2rBi4kwnGiWnb7shby
						XfX6SYdAr/0+nKxALlkG5WR8O2GUa749KuVKocgupQHVkXCvNb2Bs6CU9JikUWdLdSd28U8YtFZaqkW2tsGqVFyK8JeJRcUh94oY
						k7eYpLJ66G5oks5cmyVZnnD8fjhorrx/PGcwZFBNrrPlOqGS+QYsQ4kDRcY150JzHPoAiPRMhmoySusmjyEsjv0p2IxGzwjbjLGY
						5BhypjlmahWjpuqXbkuY8+w/DAlixT+NPnlIERSnKbTMxie57vtMebKrMThzDONJQgxSGodOTNkmAO89WB7rH2SW+ZoXgzrxWjOS
						k3bzN2Er+3IL/TvUvorFvNDpYMqpI9ebQwnx5vB7+uJWxQE5vXjMfh8e76gTMykHfOF3FyYt90T720cRN4XrrSc2edgjBLVCSdm8
						ox2YqqRpMqursuD32ARLw0ewBNhdN6mZmgkf0/kqfE6h7Li3wva6uksQKntxnz0ZrM/2IPWtSwt3lML3rUbpSptj9DHTqJ4S1AvO
						snK7JD13E9LvfFA/WrF7KAd5VG4+/wrpgCSNf6fYa6WKmNhpL3Ngjrwul+VaNi7yFgvtwOSDvlm2ro2i2z42wQdGXq/kwqGBceU2
						1CyPJKdLZZ+jbyvNY1Ul4ofagpZrxBw1EMWIcyTZMhoPUnzuzSvE/FVQ58A/jXfKPZWnypukfWzWE+4O5fKG9gLxeUG6pqIKs677
						0/mjhzSgbtiDjozj/dzsi+5DFaldwXPWwuoShPqPpRXj9Zwv8Ew9Qbno2iUX35AaVJYJOSkv40ICoLpQTg3WLQZ1oiiS7wCpd1uX
						mYx9/hGEV1ZmBSau0mUOaEmg/hQmECz/rkB84pm6ZhaCghsbTUnvGjO0GnYsmADvU7B1VkxClK/zv2J32O7t2nKx19eQQSnLn9zn
						mm3s1Z6v5fpgSmlVIDqoz2njK8Aqv5o93r1/LpJ9OdRUgOeeFG/xjtZlymNI9pJZio4aY/YdoNpof6aL7IeOjT5PqDJVn0MAQat9
						NkZGaR2DiWlxigb7BKR8fSglGv0R6VVru5Z/wf80pAKmpWYihWb6AGPH4HF49RkwFsn5GSOi1KgMdqVsZSwQbltEZgi5Xd7SM1V8
						7C38Bb2KhRCZ5piKf51oP6ZSJNfwjmaIoPHgR/COycdFBt6OmRxgQQp5MWcLOriq0cjPJj6dfnJiICM2qPaZxRBG/Rdggjrf/2xw
						WSXloc4y5V/CzaNTeKhXLtJItHpgHJqh/o7bDa0ps5zzXeArXfWmOT5EpsT5tb+56Pbfkl+oA2Jos2B+oLUcN+LrXwqOnuEguxac
						33B7VGEtY92Tzi4gVtt+bJi9YuB7SzEtto49j8XRmFNKRdTOj5wYekuiDWZFGJVVH4vXmUslJ2BTQ9P/qnXUOzUREfQ/PYWKEhso
						QTOhxfsxxpv5MQ/URSRPKD58ik3uemWdB7ijzySq3+/pXP4XARmtcd2GSt17halmPuWxigISjkjgOpEK9DbF+hGNq97TRFFUyfL/
						gue0rspGPC6lPLep8OIi56EFh/mZMAwmGhcofiJVTFffvPcZRAwdaFfG7Y56lqH4+/VH+iUvcRKNXEWJZWslwmy2g5QocoQ0TlMf
						hQR8/Lt+WlzCs+Br6sZrgwWIgL66T/OTD9GNkcTlEiJjiCz82k5nlWX1SRx0CE8iZeOg8Y4DfGL0uNsIPt88GshY3m592/YJhCRN
						cgonbAnpRxIPwOYDkrlWtCoBwOs6uD+I6XQARXND2E9BxSTf+63Qzxec8/FreT4lI6OmBYCqHxO50nEz/ovNn9RPs1izsI2tI8yk
						D/AxYylU4vbmXu+8roe2bfZHada6ZrZb0A1ywMzH1mtURoDKIMRxDLo7IUoTTAUUeTl45ICySl03gqa/BkPZPRh6Gtkii2I6EPjF
						GMrzxLo9GLj58f8iO8Vhj/q31dVZrEWK1ckOM6ZBg2+b5qfG9eKfqG5kv0x3HXpHztZxw070rTmzR0hHuCrCr5kJsR9ljm1d3iIx
						yTB4JV0gO89/XSblGSQhLOk0PAx2+EMJaJDd8Tet4LNfu17mVSruujf1FufUjKRk55fIZ/V19dasGnvoeL0f7U8/goGqlVgDpSjy
						BY6VvttFgO2ZoiW9+xEguFtZyexSVsSpYRMkIT4ofQWWmxl8LrEofdO8eG6GvH/ZWhR3lLbT+3Qv3X9ifdKrOPrp1zne+/JvVezU
						8ANzQUI93H5yU0cI4mNATjr3pnQHAAxH//oyNaoyRQ5ADlJsyFNwCD7p/l/yvNFL+HEtB8zaE0opTwO8dF6dgJjmEsgQLqfI4TL3
						LksCZ7o6xRODf+aBkeIcQlfmPRLiP/Q7duA0VddOhIHgIPKfoS+a2FxBZgntQclbqhPDITs5YAKylZGDuTZqAYpZD2bb9Ff+3TI1
						6cLyqGcJ/jDdXkS/YpWqXtNIRi413BN0glGNiOtU8C1tAVgEMeDIhmN+fOcfyaSXWYfhyx+K7u+JixPeQhA9p4FcI4hOW2c+JdhV
						I7/8+pD++ZUcC8G40nW4GWdc746dE7bIA124tuYr0/rh1JyZ2CQ+pzklgyZCV7C5gTmSwJmnIyhjBngjkmi1W35d03Il4GSkWxig
						fiXO6jAYFY7Wfh/JpJOBjbEs+VPi5wRBuwm3C9svW0B/ximge/MCii6SbhQsgZN2P+CyPnyZEK9dq2VdAQPQrOVaNYqOl0KoiNHN
						MB4eNLoNLlpI9zcpJEDOFOFlH3ha6zqYp1UFLFXe+FucITRSShJoR+s5EiV8vd8LrvJ857sSYdhgY8rdrLCYTQlOp3RLodQwzU6A
						MEnt8NQrnC/xCHJi/QinUat7ebTKs6vdaWi24QClqyiCe20eai3oE4kmFoTE5KwQNrDm6mNSmqK9v4FYR4LKbcdYV9bKmj2TA1ZC
						RbW3OPzzv++Jzeju8z5MVGpFOBqmFPoEcq0jo/UUwrt4Gf5jEjYqWTLDzQG0OzFWRsB4qPESZv961fTmcNLVrfRA50
					</xenc:CipherValue>
				</xenc:CipherData>
			</xenc:EncryptedData>
		</wsse:Security>
	</soap:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="Id-17783924">
		<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
			Id="ED-6" Type="http://www.w3.org/2001/04/xmlenc#Content">
			<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc" />
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference
					xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
					<wsse:Reference URI="#DK-5"
						ValueType="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512/dk" />
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>KQ1jaDGc09yPAls7EcHC///k
					AgcVTuEAuki5Nt2i1H9vGsdQnHuWeYXdvnwYQ6t16w5np0kRad9qZrr4baVEOFIpRweRJhm5B5N+Z42TwvK+Oo4S6AClcEUMGK4W
					GL/A6x6jLotU7lMCH0vF0BfZdos6uyWhdY6Rn60djf4dG35U5Ttpi2/OIn+wbhM+qb70LeK9kGM8HDQm843KuBLwVyBcedeFFwWR
					9A5kA1Zcrk8gjAqf1sZb/gdrSA3ievaFKw2dYHo640PEHC+EcXiLm791eU/li6ILZ8InNa8krcb8ZIDY26Te8uCLW1nA1Z3tF8rZ
					/H9uKKU6e4FftJ8SrCHctUnnSLJkphIfCMlQyWAf4x1bx6Vd/ea0gGSf4I+1qDqYA/9Nvp/uBIAuvgNFcc80Qg7BYvagpS+o9iSZ
					bRI9Q1iJx96ggcT6RMONyDHsQ8kTB2ka3GLzHzzhMGrjVb9pY4Et5LToxvA6qbU5SO/9h5O3ItvQgQQ2vtVFBieBOPTwOYP+uMxS
					Sf9q4M45FOa4PtnWbm0lMsHCdneJpJoGZt02FGGSm9APCDbTzz0MZ4vQOApGHkNBCfVR6QRHrmtaQB/daD+ZiLp34SJ954RgPvg5
					uMcSJazzsIsuCnBy0aXJmynubQwQ+5ny0l2IYjR4x4B5Ph/thQqMPK8FyzaDq35ArtXApvTMCX/3YySZkK4XV2UDzzE5YfKhXwIY
					5dwrlF0piDSAuqiwUPtSs9mJhYSoUVyjEE6m9ioCizZNHo102Fynfv3pHu+/mSf4uUmdVNrYUBlde7QEekaxifrpCK070JKTR/MZ
					GeaUfiSHUPxvgaFudT5rUaB0HWZZhxqA3nj4R1HV0oipqgVB/pjT+Hp6rhFL87MA/lIz6XQiNbqyLJhoCR91R6iEetq2Y9We3oWE
					s5cARLvaz2Qmn52qGhLG3EdB2gEjTNOMudE7b2EGxm5eH7XnNMHctt1tYjM4zIBMslwm4BF201LqHSd4/F+0NzRPK/B1AZeeAhKS
					S9EPiNC232OCQ7PdZnN5w5diMC+8L3Q2g9sKTIdn7d4jlihZddgfiJ5FIMqQakzFyX8uNL5aUxsITpJ4KQ4clVvOIoU/BvAgCWhR
					D0c5X+vbXemz7/IbMY1cjxa9gz3QdacW7fesbKrOeffuwohTtLVWiy7a5z+Ly+ksmEUkWVX62z0U0UpGQrq+HcD6RsATL4fG5O/r
					k2/37Q9/cbc/N6p5QSCoEdJ8NKTNcKa240UuTjFW+Ofn6KsdSkRJGQBvE+6Hqh2R8302F1zxc8wp8EQ5XfejicPa49xFMHTYTYau
					ckrNGfSHRRfGOQjbtaa+jv06TS0UuFaOxpQ+oxWtRxQ8y7AJOzxyZ8E8vOF60DcRAzWueyElZKVNPetMpB557hdd+9la5/8VX4j5
					VN7Sx+8HxOcDxghozTlZRp/x3fzMh5IGv0U2kmO81sVtzimmyYXJiscpBbtsiXTE2HBA/RPVlLT9hW7tEp8vuvH1V+Jt8sNcAGAK
					bHR3xhATUy/CCfqRg8TY3hM+BGIIwUXxHwSn8Lf0ODtPKl6hnqhPSatCNUNNgIakhPy/jk5zza+MVZfTHO6yvNBlNJv4tYDdh5br
					fUK2NwURM8TgVukvNlqAjoIL5l8Le6JkMYZ/VWGfUdH/vIamWigHsJppQisTxEycppAof1lBjY0cuxaEs0yo6yoj/5XgML/kpkX5
					ypOyHltSH9WAkJ6hYOGrkQhi0WvyFmzoYNEyv4D7tuhBaQPW8Se811Hh9UE9C33mKO3CtFtIajKgg5c8fORdpPBsXJtn8CxGmBh5
					tAQhln3jtR6Cg2udsHV0GDDddH3JpjDAxj63eJui5Rh0jXE0UilSjPb8o/EWYiZOQP6nyQGpB/VEW18+vFMS8q4dm+TH1ikabmBB
					thDzMoXje+SpiqLK883xk1iKprUg9FDzG/2vhpn9XsLyDt+LoTmWyWyuRGiWAuUSoKCCotVmdvkLMu/768WmDt+R5Wfjge+CB2Hs
					c450oIFfRXjyAhRrLsrpAYvLnklegIvIqdCIgsuvDiGC0nkUArbS+KhD02RlMtbejly1FFCnuHB41A9uIBjiLb9sqm4IDf21owkm
					ImxqgaySW/5oJgefiFSIYj+dV5Gtti/4AAmXZeLx/icMGEyzC0mYz79TJcjUQybLBthvLKKi6OqP38nKvzXJ71gqUvhc/dKSdpMb
					OJMO+kw42r9YBXEiPWILRMrO/sCFjB7QHy/agUqoZXMPXBs4GcVGW83u58gsLjMGFIVCCmRxDXg9lcOqhjvd0E/rrMUB8v/NnnWQ
					DHqRpr19ARTg/auUK4ltG36QvI88hMmNWy/Jkf1+XHUprREK/+0mcStzxK7wDa/lDYNPOujQX+TfL/NUK959XWtLpDV8x5WmET5s
					8CuGg9UBfoIh4e87emqKQMGVwMeMc4ThqbP0z9ACkQBbMfttAqjJ/XEdKa8IVzM4yA0MUtm1c/kc/CojgTFIOPrP6y1jxt5M9PeY
					ui4s1wThUMqwbq07vIVzbR/TyFWjOYo7pFQv9YduUILfgUtBHxkyq4ATibetoTWCMO2C+Cs7L5MaTWVfbkqC2a/Tli5LSsIHpvid
					4ktgVrDkeGGr5oKro7xiQoAA69CH9yM7CuIDQt3pSTYiYk0LXP5VmSGDvDEGTR9QtVlIdg0FiZjS4BmMJmBToBZw+BHzRcSuPW6o
					8Ziz8aYXMd800DrRVBRmXjHNy1ssWd2XSVV18Da9Vvc/xoSCk/fGKFwt2Az7vSj/0geWsfxCnVKJ1D7XZisHivpF747Wi1Dwe58f
					lxPxIyTu4a9jH28DuyTYMA2j99saUYN98szS9w4+uklHfdrpl34UnhQfclQ9T7PZ+z9+46n5zxvTKbLmCVEhMxBeSN79zDUnOppK
					vqFSRo9cEDsW9spjPfOk25Bbs+QjUC/z+YtMcV4Hf0eJGQYMerqQN0roP7a7x7x6I4rvDtO3FHCIJsl1rwiuFe/ctFGwfnB1N4hU
					YvNEISrTWWVoEci61Weuz//fiiyO2AyVDlUAICHkNdksaWxt1dqwx6M/wltJhcccAli6EXea6fFsNnB7Dcbzl3fxNv0D9WS+jHym
					w7NsTB5vocGKYVNPxjnSPrH7O7GqEILpRCQz4rxI1FFIPWW9k0bAv07zwfG7uVGagmFjgML9H24k1ttQMo2HIs3XPOXhfdEuImkf
					Y2E8m3hq4h8w3l2Bjk4=
				</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</soap:Body>
</soap:Envelope>